{"Niveau": "Masterstudium", "Lernergebnisse der Lehrveranstaltungen/des Moduls": "Folgende Kompetenzen werden in der Lehrveranstaltung erarbeitet:\n\n- Die Studierenden können selbst Speicherkonzepte im Kontext einer konkreten Problemstellung implementieren.\n- Die Studierenden sind überdies in der Lage die Implementierung dieser Systeme mit Blick auf die Skalierbarkeit und die Anforderungen des Betrieb zu gestalten.", "Voraussetzungen der Lehrveranstaltung": "Die Studierenden verfügen über Vorwissen im Bereich Informationstechnologien im Umfang von 6 ECTS und kennen daher das Konzept der Relationalen Datenbank und können einfache SQL-Abfragen lesen.", "Lehrinhalte": "Folgende Inhalte werden in der Lehrveranstaltung besprochen:\n\n- Konzeption und Implementierung von problemzentrierten NoSQL Datenbanken (z.B. Key-Value-Stores, Document Stores, Column-Oriented Data Stores, usw.)\n- Konzeption und Implementierung von Speicherlösungen für große Datenmengen (Big Data)", "Empfohlene Fachliteratur": "PRIMÄRLITERATUR:\r\n- Kleppmann, M. (2017): Designing Data-Intensive Applications: The Big Ideas Behind Reliable, Scalable, and Maintainable Systems (Ed. 1), O'Reilly Media, Farnham (ISBN: 978-1449373320)\n\r\nSEKUNDÄRLITERATUR:\r\n- Celko, J. (2013): Joe Celko’s Complete Guide to NoSQL: What Every SQL Professional Needs to Know about Non-Relational Databases (Ed. 1), Morgan Kaufmann, Waltham (ISBN: 978-0124071926)", "Bewertungsmethoden und -Kriterien": "Folgende Prüfungsmethoden werden in der Lehrveranstaltung zum Einsatz gebracht:\n\n- Projektarbeit\n- Hausarbeiten", "Unterrichtssprache": "Deutsch", "Anzahl der zugewiesenen ECTS-Credits": "5", "Semesterwochenstunden (SWS)": "", "Geplante Lehr- und Lernmethode": "Folgende Methoden kommen zum Einsatz:\n\r\n- Bearbeitung von Übungsaufgaben\r\n- Vortrag mit Diskussion", "Semester/Trisemester, In dem die Lehrveranstaltung/Das Modul Angeboten wird": "1", "Art der Lehrveranstaltung/des Moduls": "", "Art der Lehrveranstaltung": ""}