{"Niveau": "Masterstudium", "Lernergebnisse der Lehrveranstaltungen/des Moduls": "Folgende Kompetenzen werden in der Lehrveranstaltung erarbeitet:\n\n- Die Studierenden kenne die besonderen Herausforderungen die bei der Speicherung und Verarbeitung großer Datenmengen (V-Modell: Volume, Variety, Velocity, Veracity) auftreten.\n- Die Studierenden kennen Möglichkeiten diesen Herausforderungen zu begegnen (hierzu werden beispielhaft Systeme aus den jeweiligen Bereichen des V-Modells besprochen).\n- Die Studierenden können entsprechende Lösungen selbst mit Blick auf eine konkrete Problemstellung entwickeln und zur Anwendung bringen.", "Voraussetzungen der Lehrveranstaltung": "Keine Voraussetzungen", "Lehrinhalte": "Den Studierenden werden in die grundlegenden Eigenschaften von Big Data eingeführt. Dabei wird besonderes Augenmerk auf den Umgang mit diesen Daten gelegt und das erworbene Wissen mit Beispielen gefestigt. Für die Lösung von Big Data Problemen, werden geeignete Frameworks vorgestellt und im Rahmen von interaktiven Workshops mit Fallstudien bearbeitet. Als Beispiele hierfür sind zu nennen:\n\r\n- Apache Hadoop\r\n- Apache Spark\r\n- Apache Flink\r\n- Apache Storm\r\n- Apache Samza\r\n- Apache Kafka\n\r\nDiese Frameworks sollen anhand von Fallbeispielen erklärt und eingesetzt werden. Dafür kann auf die zentral bereitgestellten Data Labs zugegriffen werden.", "Empfohlene Fachliteratur": "PRIMÄRLITERATUR:\r\n- Jain, V. K. (2017): Big Data and Hadoop (Ed. 1), Khanna Book Publishing, New Delhi (ISBN: 978-9382609131)\r\n- Karau, H.; Warren, R. (2017): High Performance Spark: Best Practices for Scaling and Optimizing Apache Spark (Ed. 1), O'Reilly Media, Farnham (ISBN: 978-1491943205)\n\r\nSEKUNDÄRLITERATUR:\r\n- O'Neil, C.; Schutt, R. (2013): Doing Data Science. Straight Talk from the Frontline (Ed. 1), O'Reilly Media, Sebastopol (ISBN: 978-1449358655)\r\n- Narkhede, N.; Shapira, G.; Palino, T. (2017): Kafka: The Definitive Guide: Real-Time Data and Stream Processing at Scale (Ed. 1), O'Reilly Media, Farnham (ISBN: 978-1491936160)", "Bewertungsmethoden und -Kriterien": "Klausur", "Unterrichtssprache": "Englisch", "Anzahl der zugewiesenen ECTS-Credits": "4", "Semesterwochenstunden (SWS)": "", "Geplante Lehr- und Lernmethode": "Folgende Methoden kommen zum Einsatz:\n\r\n- Vortrag mit Diskussion\r\n- Gruppenarbeiten\r\n- Interaktiver Workshop", "Semester/Trisemester, In dem die Lehrveranstaltung/Das Modul Angeboten wird": "3", "Art der Lehrveranstaltung/des Moduls": "", "Art der Lehrveranstaltung": ""}