{"Niveau": "Masterstudium", "Lernergebnisse der Lehrveranstaltungen/des Moduls": "Folgende Kompetenzen werden in der Lehrveranstaltung erarbeitet:\n\n- Die Studierenden kennen unterschiedliche, weiterführende Datenspeicherkonzepte (z.B. NoSQL Datenbanken, verteilte Datenbanken usw.).\n- Die Studierenden können Datenspeicherkonzepte hinsichtlich ihrer Eignung für Projekte vergleichen und auswählen.\n- Die Studierenden verstehen die speziellen Anforderungen an Datenspeicherung, die aus der Verwendung von sehr großen Datenmengen (Big Data) hervorgehen.", "Voraussetzungen der Lehrveranstaltung": "Die Studierenden verfügen über Vorwissen im Bereich Informationstechnologien im Umfang von 6 ECTS und kennen daher das Konzept der Relationalen Datenbank und können einfache SQL-Abfragen lesen.", "Lehrinhalte": "Folgende Inhalte werden in der Lehrveranstaltung besprochen:\n\n- Eigenschaften von performanten Datensystemen (Skalierbarkeit, Wartbarkeit, Reliabilität)\n- Etablierte Konzepte der Datenspeicherung (Relationales Modell)\n- Historische Konzepte der Datenspeicherung (Hierarchisches Modell, Netzwerkmodell)\n- Moderne Konzepte der Datenspeicherung (Wide-column Modell, Graphen Modell, Key-Value Modell, Document Modell, Column-oriented Modell)\n- Datenbanksysteme, passend zu den behandelten Modellen\n- Skalierung von Datensystemen (Replication und Partitionierung)\n- Schreiben und Lesen in Datensystemen (Indexstrukturen, Schreibstrategien)", "Empfohlene Fachliteratur": "PRIMÄRLITERATUR:\r\n- Kleppmann, M. (2017): Designing Data-Intensive Applications: The Big Ideas Behind Reliable, Scalable, and Maintainable Systems (Ed. 1), O'Reilly Media, Farnham (ISBN: 978-1449373320)\n\r\nSEKUNDÄRLITERATUR:\r\n- Celko, J. (2013): Joe Celko’s Complete Guide to NoSQL: What Every SQL Professional Needs to Know about Non-Relational Databases (Ed. 1), Morgan Kaufmann, Waltham (ISBN: 978-0124071926)", "Bewertungsmethoden und -Kriterien": "Klausur", "Unterrichtssprache": "Deutsch", "Anzahl der zugewiesenen ECTS-Credits": "4", "Semesterwochenstunden (SWS)": "", "Geplante Lehr- und Lernmethode": "Folgende Methoden kommen zum Einsatz:\n\r\n- Vortrag mit Diskussion\r\n- Bearbeitung von Übungsaufgaben\r\n- Interaktiver Workshop", "Semester/Trisemester, In dem die Lehrveranstaltung/Das Modul Angeboten wird": "1", "Art der Lehrveranstaltung/des Moduls": "", "Art der Lehrveranstaltung": ""}